{"config": {"layers": [{"config": {"input_dtype": "float32", "batch_input_shape": [null, 455], "sparse": false, "name": "input_1"}, "class_name": "InputLayer", "name": "input_1", "inbound_nodes": []}, {"config": {"W_constraint": null, "bias": true, "input_dim": 455, "activity_regularizer": null, "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "output_dim": 100, "name": "dense_1", "activation": "linear", "b_regularizer": null, "b_constraint": null}, "class_name": "Dense", "name": "dense_1", "inbound_nodes": [[["input_1", 0, 0]]]}, {"config": {"epsilon": 0.001, "name": "batchnormalization_1", "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "mode": 0, "axis": -1, "beta_regularizer": null}, "class_name": "BatchNormalization", "name": "batchnormalization_1", "inbound_nodes": [[["dense_1", 0, 0]]]}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation", "name": "activation_1", "inbound_nodes": [[["batchnormalization_1", 0, 0]]]}, {"config": {"W_constraint": null, "bias": true, "input_dim": 100, "activity_regularizer": null, "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "output_dim": 100, "name": "dense_2", "activation": "linear", "b_regularizer": null, "b_constraint": null}, "class_name": "Dense", "name": "dense_2", "inbound_nodes": [[["activation_1", 0, 0]]]}, {"config": {"epsilon": 0.001, "name": "batchnormalization_2", "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "mode": 0, "axis": -1, "beta_regularizer": null}, "class_name": "BatchNormalization", "name": "batchnormalization_2", "inbound_nodes": [[["dense_2", 0, 0]]]}, {"config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation", "name": "activation_2", "inbound_nodes": [[["batchnormalization_2", 0, 0]]]}, {"config": {"W_constraint": null, "bias": true, "input_dim": 100, "activity_regularizer": null, "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "output_dim": 100, "name": "dense_3", "activation": "linear", "b_regularizer": null, "b_constraint": null}, "class_name": "Dense", "name": "dense_3", "inbound_nodes": [[["activation_2", 0, 0]]]}, {"config": {"epsilon": 0.001, "name": "batchnormalization_3", "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "mode": 0, "axis": -1, "beta_regularizer": null}, "class_name": "BatchNormalization", "name": "batchnormalization_3", "inbound_nodes": [[["dense_3", 0, 0]]]}, {"config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "class_name": "Activation", "name": "activation_3", "inbound_nodes": [[["batchnormalization_3", 0, 0]]]}, {"config": {"W_constraint": null, "bias": true, "input_dim": 100, "activity_regularizer": null, "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "output_dim": 1, "name": "dense_4", "activation": "linear", "b_regularizer": null, "b_constraint": null}, "class_name": "Dense", "name": "dense_4", "inbound_nodes": [[["activation_3", 0, 0]]]}, {"config": {"epsilon": 0.001, "name": "batchnormalization_4", "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "mode": 0, "axis": -1, "beta_regularizer": null}, "class_name": "BatchNormalization", "name": "batchnormalization_4", "inbound_nodes": [[["dense_4", 0, 0]]]}, {"config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "class_name": "Activation", "name": "activation_4", "inbound_nodes": [[["batchnormalization_4", 0, 0]]]}], "output_layers": [["activation_4", 0, 0]], "input_layers": [["input_1", 0, 0]], "name": "model_1"}, "keras_version": "1.2.2", "class_name": "Model"}